In [2]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\subhas\anaconda3\lib\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\subhas\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\subhas\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\subhas\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\subhas\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\subhas\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [3]:
import pandas as pd

In [4]:
pd.__version__

'2.0.3'

# Introduction to Series
* series is one dimension

In [5]:
vowel=['a','e','i','o','u']
s=pd.Series(vowel)

In [6]:
s

0    a
1    e
2    i
3    o
4    u
dtype: object

In [7]:
type(s)

pandas.core.series.Series

In [8]:
s.index

RangeIndex(start=0, stop=5, step=1)

In [9]:
s.index.tolist()

[0, 1, 2, 3, 4]

In [11]:
s.values.tolist() #list

['a', 'e', 'i', 'o', 'u']

In [12]:
s.values[4]

'u'

In [13]:
s[3]

'o'

In [15]:
s.values[3]

'o'

In [16]:
vowel=['a','e','i','o','u']
s=pd.Series(vowel,index=[101,102,103,104,105])
s

101    a
102    e
103    i
104    o
105    u
dtype: object

In [17]:
s[103]

'i'

In [18]:
s.values[2] # values starts from 0

'i'

In [19]:
s=pd.Series(['Ram','Shyam','anshu','sunil','subhas'],name='stdName')
s

0       Ram
1     Shyam
2     anshu
3     sunil
4    subhas
Name: stdName, dtype: object

In [20]:
s2=pd.Series([1,6,5,3,4],name='semester')
df=pd.concat([s,s2],axis='columns')
df

  stdName  semester
0     Ram         1
1   Shyam         6
2   anshu         5
3   sunil         3
4  subhas         4

In [21]:
pd.concat([s,s2],axis='rows')

0       Ram
1     Shyam
2     anshu
3     sunil
4    subhas
0         1
1         6
2         5
3         3
4         4
dtype: object

In [25]:
df=pd.read_csv(r"C:\Users\subhas\Desktop\AI-ML-Bootcamp\penguins.csv")

In [26]:
df

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE
...,...,...,...,...,...,...,...
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,FEMALE
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,MALE
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,FEMALE
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE

In [27]:
df.shape

(344, 7)

In [28]:
df.columns.tolist()

['species',
 'island',
 'bill_length_mm',
 'bill_depth_mm',
 'flipper_length_mm',
 'body_mass_g',
 'sex']

In [30]:
df.head() #preview for 1st 5 items

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE

In [31]:
df.tail()# previes last 5 items

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,FEMALE
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,MALE
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,FEMALE
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE

In [33]:
df.sample(3, random_state=2024)

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
161,Chinstrap,Dream,51.3,19.9,198.0,3700.0,MALE
318,Gentoo,Biscoe,48.4,14.4,203.0,4625.0,FEMALE
85,Adelie,Dream,41.3,20.3,194.0,3550.0,MALE

In [34]:
df.describe()

       bill_length_mm  bill_depth_mm  flipper_length_mm  body_mass_g
count      342.000000     342.000000         342.000000   342.000000
mean        43.921930      17.151170         200.915205  4201.754386
std          5.459584       1.974793          14.061714   801.954536
min         32.100000      13.100000         172.000000  2700.000000
25%         39.225000      15.600000         190.000000  3550.000000
50%         44.450000      17.300000         197.000000  4050.000000
75%         48.500000      18.700000         213.000000  4750.000000
max         59.600000      21.500000         231.000000  6300.000000

In [35]:
a=df.describe(include='object')
a

       species  island   sex
count      344     344   333
unique       3       3     2
top     Adelie  Biscoe  MALE
freq       152     168   168

In [36]:
df.head(2)

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE

In [37]:
df['species'] #accesing colum of dataframe

0      Adelie
1      Adelie
2      Adelie
3      Adelie
4      Adelie
        ...
339    Gentoo
340    Gentoo
341    Gentoo
342    Gentoo
343    Gentoo
Name: species, Length: 344, dtype: object

In [38]:
df['species'].unique()

array(['Adelie', 'Chinstrap', 'Gentoo'], dtype=object)

In [39]:
df['sex'].unique()

array(['MALE', 'FEMALE', nan], dtype=object)

In [41]:
df['species'].value_counts()

species
Adelie       152
Gentoo       124
Chinstrap     68
Name: count, dtype: int64

In [42]:
df.island.value_counts()

island
Biscoe       168
Dream        124
Torgersen     52
Name: count, dtype: int64

In [49]:
df.sort_values(by=['body_mass_g']) #ascending order

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
190,Chinstrap,Dream,46.9,16.6,192.0,2700.0,FEMALE
64,Adelie,Biscoe,36.4,17.1,184.0,2850.0,FEMALE
58,Adelie,Biscoe,36.5,16.6,181.0,2850.0,FEMALE
116,Adelie,Torgersen,38.6,17.0,188.0,2900.0,FEMALE
98,Adelie,Dream,33.1,16.1,178.0,2900.0,FEMALE
...,...,...,...,...,...,...,...
337,Gentoo,Biscoe,48.8,16.2,222.0,6000.0,MALE
253,Gentoo,Biscoe,59.6,17.0,230.0,6050.0,MALE
237,Gentoo,Biscoe,49.2,15.2,221.0,6300.0,MALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN

In [51]:
df.sort_values(by=['body_mass_g'],ascending=False)

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
237,Gentoo,Biscoe,49.2,15.2,221.0,6300.0,MALE
253,Gentoo,Biscoe,59.6,17.0,230.0,6050.0,MALE
297,Gentoo,Biscoe,51.1,16.3,220.0,6000.0,MALE
337,Gentoo,Biscoe,48.8,16.2,222.0,6000.0,MALE
331,Gentoo,Biscoe,49.8,15.9,229.0,5950.0,MALE
...,...,...,...,...,...,...,...
58,Adelie,Biscoe,36.5,16.6,181.0,2850.0,FEMALE
64,Adelie,Biscoe,36.4,17.1,184.0,2850.0,FEMALE
190,Chinstrap,Dream,46.9,16.6,192.0,2700.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN

In [53]:
df['sex']=="MALE"

0       True
1      False
2      False
3      False
4      False
       ...
339    False
340    False
341     True
342    False
343     True
Name: sex, Length: 344, dtype: bool

In [55]:
df.loc[df['sex']=='MALE']

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
5,Adelie,Torgersen,39.3,20.6,190.0,3650.0,MALE
7,Adelie,Torgersen,39.2,19.6,195.0,4675.0,MALE
13,Adelie,Torgersen,38.6,21.2,191.0,3800.0,MALE
14,Adelie,Torgersen,34.6,21.1,198.0,4400.0,MALE
...,...,...,...,...,...,...,...
333,Gentoo,Biscoe,51.5,16.3,230.0,5500.0,MALE
335,Gentoo,Biscoe,55.1,16.0,230.0,5850.0,MALE
337,Gentoo,Biscoe,48.8,16.2,222.0,6000.0,MALE
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,MALE
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE

In [57]:
df.loc[df.sex=='FEMALE']

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE
6,Adelie,Torgersen,38.9,17.8,181.0,3625.0,FEMALE
12,Adelie,Torgersen,41.1,17.6,182.0,3200.0,FEMALE
...,...,...,...,...,...,...,...
332,Gentoo,Biscoe,43.5,15.2,213.0,4650.0,FEMALE
334,Gentoo,Biscoe,46.2,14.1,217.0,4375.0,FEMALE
338,Gentoo,Biscoe,47.2,13.7,214.0,4925.0,FEMALE
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,FEMALE
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,FEMALE

In [58]:
b=df.loc[df.sex=='FEMALE']

In [59]:
b['body_mass_g'].mean()

3862.2727272727275

In [60]:
df.loc[df.sex=='MALE']['body_mass_g'].mean()

4545.684523809524

# mean of sex

In [63]:
df.groupby(['sex'])['flipper_length_mm'].mean()

sex
FEMALE    197.363636
MALE      204.505952
Name: flipper_length_mm, dtype: float64

In [65]:
df.groupby(['species'])['flipper_length_mm'].mean()

species
Adelie       189.953642
Chinstrap    195.823529
Gentoo       217.186992
Name: flipper_length_mm, dtype: float64

In [67]:
df.groupby(['species','sex'])['flipper_length_mm'].mean()

species    sex
Adelie     FEMALE    187.794521
           MALE      192.410959
Chinstrap  FEMALE    191.735294
           MALE      199.911765
Gentoo     FEMALE    212.706897
           MALE      221.540984
Name: flipper_length_mm, dtype: float64

# LOC VS ILOC

In [68]:
df.sample(4)

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
126,Adelie,Torgersen,38.8,17.6,191.0,3275.0,FEMALE
167,Chinstrap,Dream,50.5,19.6,201.0,4050.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
184,Chinstrap,Dream,42.5,16.7,187.0,3350.0,FEMALE

In [69]:
df.loc[24:30,['island','species']]

    island species
24  Biscoe  Adelie
25  Biscoe  Adelie
26  Biscoe  Adelie
27  Biscoe  Adelie
28  Biscoe  Adelie
29  Biscoe  Adelie
30   Dream  Adelie

In [72]:
df.loc[24:30,['island','species','flipper_length_mm']]['flipper_length_mm'].mean()

181.0

In [75]:
df.iloc[24:30,:2]  #index is given in iloc not in loc
                    #never give name in iloc

   species  island
24  Adelie  Biscoe
25  Adelie  Biscoe
26  Adelie  Biscoe
27  Adelie  Biscoe
28  Adelie  Biscoe
29  Adelie  Biscoe

# flipper_length_mm>=200-dataslice

In [83]:
df.loc[df['flipper_length_mm']>=200]

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
53,Adelie,Biscoe,42.0,19.5,200.0,4050.0,MALE
90,Adelie,Dream,35.7,18.0,202.0,3550.0,FEMALE
91,Adelie,Dream,41.1,18.1,205.0,4300.0,MALE
95,Adelie,Dream,40.8,18.9,208.0,4300.0,MALE
101,Adelie,Biscoe,41.0,20.0,203.0,4725.0,MALE
...,...,...,...,...,...,...,...
338,Gentoo,Biscoe,47.2,13.7,214.0,4925.0,FEMALE
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,FEMALE
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,MALE
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,FEMALE
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE